{
  "name": "Huntress - Enable Tamper Protection",
  "description": "",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "fc365da9-2c1b-4f79-aa4b-dedca69e728f"
          },
          "value": "vendor_msft_defender_configuration_tamperprotection_options_0"
        },
        "settingDefinitionId": "vendor_msft_defender_configuration_tamperprotection_options",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5655cab2-7e6b-4c49-9ce2-3865da05f7e6"
        }
      }
    }
  ],
  "roleScopeTagIds": ["0"],
  "platforms": "windows10",
  "technologies": "mdm,microsoftSense",
  "templateReference": {
    "templateId": "d948ff9b-99cb-4ee0-8012-1fbc09685377_1"
  }
}
